Create a function that takes a DataFrame of numerical columns and returns the column with the highest mean.
df = pd.DataFrame({
    'A': [10, 20, 30, 40, 50],
    'B': [5, 15, 25, 35, 45],
    'C': [100, 200, 300, 400, 500]
})

In [76]:
import pandas as pd

df = pd.DataFrame({
    'A': [10, 20, 30, 40, 50],
    'B': [5, 15, 25, 35, 45],
    'C': [100, 200, 300, 400, 500]
})

def High_mean(df):
    col_name = df.mean().idxmax()
    max_mean = df.mean().max()
    return col_name, max_mean

High_mean(df)
print(f"{column},{mean_value}")

C,300.0

Consider data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'Salary': [50000, 54000, 49000, 62000, 58000],
    'Join_Date': ['2021-01-15', '2020-03-22', '2022-07-10', '2019-11-05', '2023-02-14'],
    'Email': ['alice@example.com', 'bob@example.com', 'charlie@example.com', 'david@example.com', 'eva@example.com']
}
df = pd.DataFrame(data)
print(df)

1. Write a function to calculate the bonus (10% of salary) for each employee and add it as a new column.

In [77]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'Salary': [50000, 54000, 49000, 62000, 58000],
    'Join_Date': ['2021-01-15', '2020-03-22', '2022-07-10', '2019-11-05', '2023-02-14'],
    'Email': ['alice@example.com', 'bob@example.com', 'charlie@example.com', 'david@example.com', 'eva@example.com']
}
df = pd.DataFrame(data)
print(df)

def calculate_bonus(df):
    df['Bonus']=df['Salary']*0.1
    return df

calculate_bonus(df)
df

      Name  Age  Salary   Join_Date                Email
0    Alice   24   50000  2021-01-15    alice@example.com
1      Bob   27   54000  2020-03-22      bob@example.com
2  Charlie   22   49000  2022-07-10  charlie@example.com
3    David   32   62000  2019-11-05    david@example.com
4      Eva   29   58000  2023-02-14      eva@example.com

      Name  Age  Salary   Join_Date                Email   Bonus
0    Alice   24   50000  2021-01-15    alice@example.com  5000.0
1      Bob   27   54000  2020-03-22      bob@example.com  5400.0
2  Charlie   22   49000  2022-07-10  charlie@example.com  4900.0
3    David   32   62000  2019-11-05    david@example.com  6200.0
4      Eva   29   58000  2023-02-14      eva@example.com  5800.0

2. Write a function to categorize employees as 'Young' if age < 25, otherwise 'Adult'.

In [78]:
def age_cat(age):
    if age <25:
        return 'Young'
    else:
        return 'Adult'
    
df['Age_Group']=df['Age'].apply(age_cat)
df

      Name  Age  Salary   Join_Date                Email   Bonus Age_Group
0    Alice   24   50000  2021-01-15    alice@example.com  5000.0     Young
1      Bob   27   54000  2020-03-22      bob@example.com  5400.0     Adult
2  Charlie   22   49000  2022-07-10  charlie@example.com  4900.0     Young
3    David   32   62000  2019-11-05    david@example.com  6200.0     Adult
4      Eva   29   58000  2023-02-14      eva@example.com  5800.0     Adult

3. Use lambda to create a new column 'Salary_After_Tax' (assuming 20% tax).

In [79]:
df['Salary_After_Tax'] = df['Salary'].apply(lambda x: x * 0.8)
df

,Name,Age,Salary,Join_Date,Email,Bonus,Age_Group,Salary_After_Tax
0,Alice,24,50000,2021-01-15,alice@example.com,5000.0,Young,40000.0
1,Bob,27,54000,2020-03-22,bob@example.com,5400.0,Adult,43200.0
2,Charlie,22,49000,2022-07-10,charlie@example.com,4900.0,Young,39200.0
3,David,32,62000,2019-11-05,david@example.com,6200.0,Adult,49600.0
4,Eva,29,58000,2023-02-14,eva@example.com,5800.0,Adult,46400.0

4. Use map to replace 'Young' with 'Y' and 'Adult' with 'A' in the 'Age_Group' column.

In [80]:
def map_x(age):
    if age == 'Young':
        return 'Y'
    else:
        return 'A'

df['Age_Group'] = df['Age_Group'].map(map_x)
df

,Name,Age,Salary,Join_Date,Email,Bonus,Age_Group,Salary_After_Tax
0,Alice,24,50000,2021-01-15,alice@example.com,5000.0,Y,40000.0
1,Bob,27,54000,2020-03-22,bob@example.com,5400.0,A,43200.0
2,Charlie,22,49000,2022-07-10,charlie@example.com,4900.0,Y,39200.0
3,David,32,62000,2019-11-05,david@example.com,6200.0,A,49600.0
4,Eva,29,58000,2023-02-14,eva@example.com,5800.0,A,46400.0

5. Convert the 'Join_Date' column to datetime format.

6. Extract the year from the 'Join_Date' column.

7. Calculate the number of months each employee has been with the company.

8. Return the last date of of working of Alice and Bob if they have resigned today.(3 months notice period)

9. Extract the domain from the 'Email' column by re module

10. Replace all occurrences of 'example.com' in the 'Email' column with 'company.com' by re module

11. Use a generator to yield rows of the employees as per seniority one at a time from dataframe.

12. Use regular expressions to find all employees whose names start with 'A'.

13. Create a Python module df_utils.py that contains functions for data cleaning .
The module should include:
remove_duplicates(df) → Removes duplicate rows.
fill_missing(df, method='mean') → Fills missing values using mean, median, or mode.
add_month_column(df, date_col) → Extracts the month name from a date column.

14. df_students = pd.DataFrame({
    'Student': ['Alice', 'Bob', 'Charlie', 'David'],
    'Marks': [90, 75, 60, 40]
})
The dataset has a column Marks (out of 100).
Convert marks to grades using map() and new column grades:
"A" if Marks ≥ 85
"B" if Marks ≥ 70
"C" if Marks ≥ 50
"F" otherwise

15. Calculate the Number of Business Days Between Order and Delivery.
df_orders = pd.DataFrame({
    'Order ID': ['ORD1', 'ORD2', 'ORD3'],
    'Order Date': ['2024-01-01', '2024-02-10', '2024-03-15'],
    'Delivery Date': ['2024-01-10', '2024-02-18', '2024-03-25']
})